logos-codegen/tests/data/export/complex/output.dot
digraph {node[shape=box];splines=ortho;n0[label="Letter",color=green];n1[label="Struct",color=green];n2[label="Str",color=green];n3[label="StrPrefixed",color=green];n4[label="Fork",color=blue];n5[label="'a'..='z'",color=orange];n4->n5;n5->n4;n4->n3;n6[label="Rope",color=blue];n7[label="'c'",color=orange];n6->n7;n8[label="'t'",color=orange];n7->n8;n8->n9;na[label="MISS",color=red];n6->na;na->n4;n9[label="Fork",color=blue];nb[label="'a'..='z'",color=orange];n9->nb;nb->n4;n9->n1;nc[label="Rope",color=blue];nd[label="'t'",color=orange];nc->nd;ne[label="'r'",color=orange];nd->ne;ne->nf;n10[label="NOT 't'",color=red];nc->n10;n10->n0;nf[label="Fork",color=blue];n11[label="'a'..='t'",color=orange];nf->n11;n11->n4;n12[label="'u'",color=orange];nf->n12;n12->n6;n13[label="'v'..='z'",color=orange];nf->n13;n13->n4;nf->n2;n14[label="Fork",color=blue];n15[label="'a'..='r'",color=orange];n14->n15;n15->n0;n16[label="'s'",color=orange];n14->n16;n16->nc;n17[label="'t'..='z'",color=orange];n14->n17;n17->n0;}
